
{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What areas does Dr. Jan Duffy specialize in?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Dr. Jan Duffy specializes in North Las Vegas, Centennial Hills, Providence, Skye Canyon, Summerlin, Lone Mountain, Aliante, Tule Springs, El Dorado, and other master-planned communities. With 30+ years of experience, she's ranked in the Top 1% of Las Vegas REALTORS®."
      }
    },
    {
      "@type": "Question",
      "name": "What is the current median home price in Centennial Hills?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The median home price in Centennial Hills is $635,000 as of 2024. Homes typically range from $450,000 for townhomes to over $2 million for luxury estates. The market has seen 8.2% appreciation year-over-year with homes selling in an average of 18 days."
      }
    },
    {
      "@type": "Question",
      "name": "How long do homes stay on the market in these areas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Homes in Centennial Hills average 18 days on market, Providence averages 22 days, Skye Canyon averages 20 days, and Summerlin averages 15 days. The competitive market means well-priced homes often receive multiple offers within the first week."
      }
    },
    {
      "@type": "Question",
      "name": "What school districts serve these neighborhoods?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "All neighborhoods are served by Clark County School District. Centennial Hills has Centennial High School (9/10 rating), Providence has Desert Oasis High (8/10), Skye Canyon has Centennial and Shadow Ridge High Schools, and Summerlin has multiple highly-rated options including Palo Verde High (9/10)."
      }
    },
    {
      "@type": "Question",
      "name": "What services does Dr. Duffy offer?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Dr. Duffy offers luxury property sales, new construction sales, first-time home buyer services, relocation assistance, investment property guidance, commercial real estate, building lot sales, and property management referrals. She provides 24/7 availability and same-day showings."
      }
    },
    {
      "@type": "Question",
      "name": "Does Dr. Duffy help with relocation to Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, Dr. Duffy provides comprehensive relocation assistance including neighborhood tours, school information, utility setup guidance, local service recommendations, and detailed market analysis. She helps families transition smoothly from anywhere in the country."
      }
    },
    {
      "@type": "Question",
      "name": "What makes these neighborhoods attractive to buyers?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "These master-planned communities offer resort-style amenities, top-rated schools, proximity to Red Rock Canyon, low crime rates, modern infrastructure, golf courses, shopping centers, and strong property appreciation. They're 20 minutes from the Las Vegas Strip but feel like suburban oases."
      }
    },
    {
      "@type": "Question",
      "name": "What is the investment potential for these areas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "These neighborhoods have shown consistent 6-8% annual appreciation, strong rental demand, low vacancy rates, and continued population growth. Centennial Hills has grown 12% in 5 years, Providence 15%, and Skye Canyon 18%, making them excellent long-term investments."
      }
    },
    {
      "@type": "Question",
      "name": "Are there HOA fees in these communities?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Most communities have HOA fees ranging from $50-300/month depending on amenities. These typically cover landscaping, community pools, fitness centers, parks, and maintenance of common areas. Specific fees vary by neighborhood and home type."
      }
    },
    {
      "@type": "Question",
      "name": "What is the process for buying a new construction home?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Dr. Duffy guides you through lot selection, floor plan choices, upgrade decisions, construction monitoring, and final walkthrough. She ensures builder compliance, negotiates on your behalf, and coordinates timing with current home sales if needed."
      }
    },
    {
      "@type": "Question",
      "name": "How competitive is the current market?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The market is competitive with 1.5-2.1 months of inventory. Well-priced homes often receive multiple offers. Dr. Duffy helps buyers with strategic offers, escalation clauses, and quick decision-making to succeed in this environment."
      }
    },
    {
      "@type": "Question",
      "name": "What are the property tax rates in these areas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Clark County property tax rate is approximately 0.75-0.85% of assessed value. Nevada has no state income tax, making it attractive for relocating families. Homestead exemptions can reduce property taxes for primary residences."
      }
    }
  ]
}
